package main

/*
Дана двумерная двоичная сетка размером m x n, которая представляет собой карту из единиц (суша) и нулей (вода), 
вернуть количество островов.
Остров окружен водой и образован путем соединения соседних земель по горизонтали или вертикали. 
Вы можете предположить, что все четыре края сетки окружены водой.

Пример 1:
Input: grid = [
  ["1","1","1","1","0"],
  ["1","1","0","1","0"],
  ["1","1","0","0","0"],
  ["0","0","0","0","0"]
]
Output: 1

Пример 2:
Input: grid = [
  ["1","1","0","0","0"],
  ["1","1","0","0","0"],
  ["0","0","1","0","0"],
  ["0","0","0","1","1"]
]
Output: 3

Ограничения:
m == grid.length
n == grid[i].length
1 <= m, n <= 300
grid[i][j] имеет значение «0» или «1».
*/

func numIslands(grid [][]byte) int {
    count := 0
    
    for i := 0; i < len(grid); i++ {
        for j := 0; j < len(grid[i]); j++ {
            if grid[i][j] == '1' {                
                dfs(grid, i, j)
				count++
            }
        }
    }
    
    return count
}

func dfs(grid [][]byte, r, c int) {
    if r < 0 || r >= len(grid) || c < 0 || c >= len(grid[r]) || grid[r][c] != '1' {
        return
    }
    
    grid[r][c] = '.'
    dfs(grid, r+1, c)
    dfs(grid, r-1, c)
    dfs(grid, r, c+1)
    dfs(grid, r, c-1)
}
