package main

/*
Обратите биты заданного 32-битного целого числа со знаком.

Пример 1:
Input: n = 43261596
Output: 964176192
Объяснение:
целое двоичное_число
43261596 00000010100101000001111010011100
964176192 00111001011110000010100101000000

Пример 2:
Input: n = 2147483644
Output: 1073741822
Объяснение:
целое двоичное_число
2147483644	01111111111111111111111111111100
1073741822	00111111111111111111111111111110

Ограничения:
0 <= n <= 2^31 - 2
n четное.

*/

func reverseBits(n int) int {
    var num uint32 = uint32(n)
    var res uint32 = 0
    
    for i := 0; i < 32; i++ {
        res = res << 1
        res += (num & 1)
        num = num >> 1
    }
    
    return int(res)
}