package main

/*
Дана доска для игры в судоку размером 9 х 9. 
Доска для игры в судоку считается действительной, если соблюдаются следующие правила:

Каждая строка должна содержать цифры от 1 до 9 без повторений.
Каждый столбец должен содержать цифры от 1 до 9 без повторений.
Каждая из девяти ячеек таблицы размером 3 x 3 должна содержать цифры от 1 до 9 без повторений.
Возвращает true, если таблица судоку действительна, в противном случае возвращает false

Примечание: Доска не обязательно должна быть полной или разрешимой, чтобы быть действительной.

Пример 1:
Input: board = 
[["1","2",".",".","3",".",".",".","."],
 ["4",".",".","5",".",".",".",".","."],
 [".","9","8",".",".",".",".",".","3"],
 ["5",".",".",".","6",".",".",".","4"],
 [".",".",".","8",".","3",".",".","5"],
 ["7",".",".",".","2",".",".",".","6"],
 [".",".",".",".",".",".","2",".","."],
 [".",".",".","4","1","9",".",".","8"],
 [".",".",".",".","8",".",".","7","9"]]
Output: true

Пример 2:
Input: board = 
[["1","2",".",".","3",".",".",".","."],
 ["4",".",".","5",".",".",".",".","."],
 [".","9","1",".",".",".",".",".","3"],
 ["5",".",".",".","6",".",".",".","4"],
 [".",".",".","8",".","3",".",".","5"],
 ["7",".",".",".","2",".",".",".","6"],
 [".",".",".",".",".",".","2",".","."],
 [".",".",".","4","1","9",".",".","8"],
 [".",".",".",".","8",".",".","7","9"]]
Output: false
Пояснение: В верхнем левом поле размером 3х3 есть две цифры "1".

Ограничения:

board.length == 9
board[i].length == 9
board[i][j] - это цифры 1-9 или '.'.

*/

func isValidSudoku(board [][]byte) bool {
	rowHms := make([]map[byte]struct{}, 9)
    colHms := make([]map[byte]struct{}, 9)
	boxHms := make([]map[byte]struct{}, 9)

	for i := range rowHms {
        rowHms[i] = make(map[byte]struct{})
        colHms[i] = make(map[byte]struct{})
        boxHms[i] = make(map[byte]struct{})
    }

	for i, row := range board {
		for j, sym := range row {
			if sym == '.' {
				continue
			}
			boxNum := i / 3 * 3 + j / 3
			_, rowOk := rowHms[i][sym]
			_, colOk := colHms[j][sym]
			_, boxOk := boxHms[boxNum][sym]
			if rowOk || colOk || boxOk {
				return false
			}
			rowHms[i][sym], colHms[j][sym], boxHms[boxNum][sym] = struct{}{}, struct{}{}, struct{}{}
		}
	}
	return true
}