package main

/*

Пример 1:
Вход: nums = [1,2,3,4,5,6,7], k = 3
Выход: [5,6,7,1,2,3,4]
Пояснение:
повернуть на 1 шаг вправо: [7,1,2,3,4,5,6]
повернуть на 2 шага вправо: [6,7,1,2,3,4,5]
повернуть на 3 шага вправо: [5,6,7,1,2,3,4]

Пример 2:
Вход: nums = [-1,-100,3,99], k = 2
Выход: [3,99,-1,-100]
Пояснение:
повернуть на 1 шаг вправо: [99,-1,-100,3]
повернуть на 2 шага вправо: [3,99,-1,-100]

Ограничения:
1 <= nums.length <= 10^5
-2^31 <= nums[i] <= 2^31 - 1
0 <= k <= 10^5

*/

func rotate(nums []int, k int) {
    n := len(nums)
    k %= n

    reverse := func(l, r int) {
        for l < r {
            nums[l], nums[r] = nums[r], nums[l]
            l++
            r--
        }
    }

    reverse(0, n-1)
    reverse(0, k-1)
    reverse(k, n-1)
}
