package main

/*
Даны два массива целых чисел nums1 и nums2. Верните массив их пересечения.
Каждый элемент результата должен быть уникальным. Результат можно вернуть
в любом порядке.

Пример 1:
Вход: nums1 = [1,2,2,1], nums2 = [2,2]
Выход: [2]

Пример 2:
Вход: nums1 = [4,9,5], nums2 = [9,4,9,8,4]
Выход: [9,4]
Пояснение: ответ [4,9] также считается правильным.

Ограничения:
1 <= nums1.length, nums2.length <= 1000
0 <= nums1[i], nums2[i] <= 1000
*/

func intersection(nums1 []int, nums2 []int) []int {
    
}
